{
  "titulo": "Contrato de utilizacao do aplicativo InTransit",
  "data": "2023-04-09",
  "partes": {
    "instituicao_ensino": {
      "nome": "Nome da instituicao de ensino",
      "codigo": "123456",
      "responsavel": {
        "nome": "Nome completo do responsavel",
        "cpf": "123.456.789-10"
      },
      "endereco": {
        "cep": "12345-678",
        "logradouro": "Nome da rua e numero",
        "complemento": "Complemento",
        "cidade": "Nome da cidade",
        "estado": "Sigla do estado"
      },
      "motoristas_vinculados": [
        {
          "nome": "Nome completo do motorista",
          "cpf": "123.456.789-10"
		  "carro": "modelo, placa e ano"
        }
      ]
    }
  },
  "usuarios": [
    {
      "tipo": "estudante",
      "nome": "Nome completo do estudante",
      "email": "exemplo@exemplo.com",
      "cpf": "123.456.789-10",
      "rg": "123456789",
      "telefone": "(81) 91234-5678",
      "endereco": {
        "cep": "12345-678",
        "logradouro": "Nome da rua e número",
        "complemento": "Complemento",
        "cidade": "Nome da cidade",
        "estado": "Sigla do estado"
      },
      "instituicao_ensino": "Nome da instituição de ensino",
      "senha": "senha123"
    },
    {
      "tipo": "motorista",
      "nome": "Nome completo do motorista",
      "email": "exemplo@exemplo.com",
      "cpf": "123.456.789-10",
      "cnh": "12345678901",
      "telefone": "(81) 98765-4321",
      "endereco": {
        "cep": "12345-678",
        "logradouro": "Nome da rua e número",
        "complemento": "Complemento",
        "cidade": "Nome da cidade",
        "estado": "Sigla do estado"
      },
      "veiculo": {
        "marca": "Marca do veículo",
        "modelo": "Modelo do veículo",
        "placa": "AAA-0000",
        "combustivel": "Tipo de combustível",
        "ano_fabricacao": 2022
      },
      "senha": "senha123"
    }
  ],
  "termos": [
    {
      "id": "termo_localizacao",
      "titulo": "Permissão de Localização",
      "descricao": "Ao utilizar o aplicativo InTransit, você concorda em permitir que o aplicativo acesse a sua localização em tempo real para fornecer informações precisas sobre o transporte de estudantes universitários."
    },
    {
      "id": "termo_armazenamento",
      "titulo": "Permissão de Armazenamento",
      "descricao": "Ao utilizar o aplicativo InTransit, você concorda em permitir que o aplicativo armazene os dados de cadastro e histórico de viagens para garantir a segurança e eficiência do serviço."
    },
	{
		"id": "termo_notificação",
		"titulo": "Permissão de Notificação",
		"descrição": "Ao utilizar o aplicativo InTransit, você concorda em permitir que o aplicativo envie e acesse as notificações do seu smartphone."
  ]
}

	{
  "nome_do_aplicativo": "InTransit",
  "descricao": "Aplicativo de transporte universitário para auxiliar estudantes no acesso às instituições de ensino",
  "versao": "1.0",
  "desenvolvedor": {
    "nome": "Grupo InTransit Nassau",
    "endereco": "Uninassau Paulista",
    "email": "intransit@email.com",
    "telefone": "819xxx9xxx0"
  },
  "termos_de_uso": {
    "versao": "1.0",
    "data_de_atualizacao": "2023-04-09",
    "descricao": "Ao utilizar o aplicativo InTransit, você concorda com os seguintes termos e condições de uso:",
    "termos": [
		"O aplicativo InTransit é destinado exclusivamente para o transporte de estudantes universitários.",
		"Os motoristas cadastrados no aplicativo InTransit são responsáveis pela segurança e integridade dos estudantes transportados.",
		"O aplicativo InTransit não se responsabiliza por quaisquer danos ou prejuízos causados durante o uso do serviço de transporte.",
		"O usuário do aplicativo InTransit é responsável por manter seus dados de cadastro atualizados e seguros, como senha de acesso e informações pessoais.",
		"O aplicativo InTransit pode utilizar as informações de localização do usuário para melhorar a qualidade do serviço oferecido.",
		"O aplicativo InTransit pode armazenar as informações de cadastro e utilização do serviço para fins de segurança e melhoria do aplicativo.",
		"O usuário do aplicativo InTransit é responsável por respeitar as leis e normas de trânsito durante a utilização do serviço de transporte.",
		"O aplicativo InTransit se reserva o direito de modificar estes termos de uso a qualquer momento, mediante aviso prévio aos usuários cadastrados."
    ],
    "aceitacao": {
      "data": "",
      "cpf": "",
      "nome_completo": "",
      "assinatura_digital": ""
    }
  },
  "politica_de_privacidade": {
    "versao": "1.0",
    "data_de_atualização": "2023-04-09",
    "descricao": "A política de privacidade do aplicativo InTransit tem como objetivo esclarecer como as informações dos usuários são coletadas, utilizadas e protegidas.",
    "coleta_de_informacoes": [
		"O aplicativo InTransit coleta informações de cadastro dos usuários, como nome completo, CPF, RG, telefone, endereço e instituição de ensino.",
		"O aplicativo InTransit coleta informações de utilização do serviço, como as viagens realizadas e mensagens enviadas.",
		"O aplicativo InTransit pode utilizar as informações de localização do usuário para melhorar a qualidade do serviço oferecido.",
		"O aplicativo InTransit utiliza cookies para lembrar as preferências dos usuários durante a utilização do serviço."
    ],
    "utilizacao_de_informações": [
		"O aplicativo InTransit utiliza as informações coletadas para fornecer e melhorar o serviço de transporte escolar oferecido.",
		"O aplicativo InTransit pode utilizar as informações para enviar avisos importantes sobre o serviço e para fins de marketing.",
		"O aplicativo InTransit não compartilha as informações dos usuários com terceiros, exceto em caso de ordem judicial ou solicitação de autoridade competente.",
		"O aplicativo InTransit pode compartilhar informações com prestadores de serviço terceirizados, como empresas de processamento de pagamentos e provedores de serviços de hospedagem, apenas para fins de operação e manutenção do serviço.",
		"O usuário do aplicativo InTransit pode solicitar a exclusão de suas informações de cadastro a qualquer momento, mediante pedido por escrito para o endereço de contato do desenvolvedor.",
		"O aplicativo InTransit se compromete a proteger as informações dos usuários por meio de medidas de segurança adequadas, como criptografia de dados e armazenamento em servidores seguros.",
		"O aplicativo InTransit se reserva o direito de modificar esta política de privacidade a qualquer momento, mediante aviso prévio aos usuários cadastrados."
	],
	"aceitacao": {
	"data": "",
	"cpf": "",
	"nome_completo": "",
	"assinatura_digital": ""
}
}
}
